## Miscellaneous Easy Topics

In [15]:
import pandas as pd
import numpy as np
import matplotlib as plt

# Base DataFrame
data = {
    'Name': ['Alice', np.nan, 'Charlie', 'David', 'Eva', 'Mayra',' Priyanka'],
    'Age': [25, 30, 35, 40, 22, 18, 19],
    'City': ['New York', 'London', 'Paris', 'New York', np.nan, 'Moscow', 'Berlin'],
    'Salary': [50000, np.nan, 55000, 70000, 65000, 72000, 80000],
    'Neg_col' : [-12, -34, -45, -56, -67 ,-78, -89]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4', 'row5', 'row6','row7'])
print(df)

           Name  Age      City   Salary  Neg_col
row1      Alice   25  New York  50000.0      -12
row2        NaN   30    London      NaN      -34
row3    Charlie   35     Paris  55000.0      -45
row4      David   40  New York  70000.0      -56
row5        Eva   22       NaN  65000.0      -67
row6      Mayra   18    Moscow  72000.0      -78
row7   Priyanka   19    Berlin  80000.0      -89

In [16]:
# 151. Use where(): where() method ka use karke 'Age' column mein 25 se kam ki sabhi values ko NaN se replace karein.
df['Age'] = df['Age'].where(df['Age']>=25, np.nan)
df

           Name   Age      City   Salary  Neg_col
row1      Alice  25.0  New York  50000.0      -12
row2        NaN  30.0    London      NaN      -34
row3    Charlie  35.0     Paris  55000.0      -45
row4      David  40.0  New York  70000.0      -56
row5        Eva   NaN       NaN  65000.0      -67
row6      Mayra   NaN    Moscow  72000.0      -78
row7   Priyanka   NaN    Berlin  80000.0      -89

In [18]:
# 152. Use mask(): mask() method ka use karke 'Age' column mein 25 se zyada ki sabhi values ko NaN se replace karein ( where ka ulta).
df['Age'] = df['Age'].mask(df['Age']>25, np.nan)
df

           Name   Age      City   Salary  Neg_col
row1      Alice  25.0  New York  50000.0      -12
row2        NaN   NaN    London      NaN      -34
row3    Charlie   NaN     Paris  55000.0      -45
row4      David   NaN  New York  70000.0      -56
row5        Eva   NaN       NaN  65000.0      -67
row6      Mayra   NaN    Moscow  72000.0      -78
row7   Priyanka   NaN    Berlin  80000.0      -89

In [19]:
# 153. Use at for fast scalar access: at ka use karke ek specific row/column label se ek single value access karein.
df.at['row3','Salary']

55000.0

In [20]:
# 154. Use iat for fast scalar access: iat ka use karke ek specific row/column integer position se ek single value access karein.
df.iat[0,1]

25.0

In [22]:
# 155. Check membership using isin() on a Series: Ek Series mein check karein ki kaun se elements ek given list [10, 30] mein maujood hain.
df.isin([10,30])

       Name    Age   City  Salary  Neg_col
row1  False  False  False   False    False
row2  False  False  False   False    False
row3  False  False  False   False    False
row4  False  False  False   False    False
row5  False  False  False   False    False
row6  False  False  False   False    False
row7  False  False  False   False    False

In [25]:
# 156. Use clip(): Ek numerical column ke values ko ek specific range ke beech limit karein (e.g., saari values 0 se 100 ke beech honi chahiye).
df['Age'].clip(lower=0, upper=100)
df

           Name   Age      City   Salary  Neg_col
row1      Alice  25.0  New York  50000.0      -12
row2        NaN   NaN    London      NaN      -34
row3    Charlie   NaN     Paris  55000.0      -45
row4      David   NaN  New York  70000.0      -56
row5        Eva   NaN       NaN  65000.0      -67
row6      Mayra   NaN    Moscow  72000.0      -78
row7   Priyanka   NaN    Berlin  80000.0      -89

In [27]:
# 157. Copy to clipboard: DataFrame ke content ko clipboard mein copy karein taaki aap use kahin aur paste kar sakein. 
df.to_clipboard(index=False)
df

           Name   Age      City   Salary  Neg_col
row1      Alice  25.0  New York  50000.0      -12
row2        NaN   NaN    London      NaN      -34
row3    Charlie   NaN     Paris  55000.0      -45
row4      David   NaN  New York  70000.0      -56
row5        Eva   NaN       NaN  65000.0      -67
row6      Mayra   NaN    Moscow  72000.0      -78
row7   Priyanka   NaN    Berlin  80000.0      -89

In [28]:
# 158. Get memory usage: Har column dwara use ki ja rahi memory ka pata lagayein. 
df.memory_usage(deep=True)

Index      671
Name       360
Age         56
City       365
Salary      56
Neg_col     56
dtype: int64

In [29]:
# 159. Get the number of dimensions: DataFrame ke dimensions ki sankhya (jo hamesha 2 hoti hai) pata karein. 
df.ndim

2

In [30]:
# 160. Get the underlying NumPy array: DataFrame ko ek NumPy array mein convert karein.
df.values

array([['Alice', 25.0, 'New York', 50000.0, -12],
       [nan, nan, 'London', nan, -34],
       ['Charlie', nan, 'Paris', 55000.0, -45],
       ['David', nan, 'New York', 70000.0, -56],
       ['Eva', nan, nan, 65000.0, -67],
       ['Mayra', nan, 'Moscow', 72000.0, -78],
       [' Priyanka', nan, 'Berlin', 80000.0, -89]], dtype=object)